Hi @quantumdecoherence ,

Thank you for bringing this issue to our attention. I attempted to reproduce it using the following script and noticed that Terraform tries to unset a default value, which should be addressed. While I didn’t encounter the exact error you described, I did come across a related issue. As a potential workaround, you could manually add ``accprofile = "super_admin"`` to your configuration.

From your error message, it seems that the ``super_admin`` option wasn’t found in FOS. Could you confirm if it’s possible to create this option via the CLI, and your terraform user has the right permission to refer ``super_admin``? If so, would you be able to share your script so I can reproduce the issue more accurately?
```
resource "fortios_system_automationaction" "trname2" {
  action_type = "cli-script"
  name        = "tf-cli-script"
  script      = "get system status"
  # accprofile  = "super_admin"
}
```
```
root@liang:~/terraform/fgt/github#349# terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated
with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_system_automationaction.trname2 will be created
  + resource "fortios_system_automationaction" "trname2" {
      + action_type                     = "cli-script"
      + alicloud_function_authorization = (known after apply)
      + alicloud_function_domain        = (known after apply)
      + aws_domain                      = (known after apply)
      + azure_domain                    = (known after apply)
      + azure_function_authorization    = (known after apply)
      + dynamic_sort_subtable           = "false"
      + execute_security_fabric         = (known after apply)
      + forticare_email                 = (known after apply)
      + gcp_function_domain             = (known after apply)
      + get_all_tables                  = "false"
      + id                              = (known after apply)
      + message                         = (known after apply)
      + message_type                    = (known after apply)
      + method                          = (known after apply)
      + name                            = "tf-cli-script"
      + output_size                     = (known after apply)
      + protocol                        = (known after apply)
      + replacement_message             = (known after apply)
      + required                        = (known after apply)
      + script                          = "get system status"
      + vdomparam                       = (known after apply)
      + verify_host_cert                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_system_automationaction.trname2: Creating...
fortios_system_automationaction.trname2: Creation complete after 0s [id=tf-cli-script]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
root@liang:~/terraform/fgt/github#349# terraform apply
fortios_system_automationaction.trname2: Refreshing state... [id=tf-cli-script]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated
with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # fortios_system_automationaction.trname2 will be updated in-place
  ~ resource "fortios_system_automationaction" "trname2" {
      - accprofile                      = "super_admin" -> null
        id                              = "tf-cli-script"
        name                            = "tf-cli-script"
        # (19 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.
```

Thanks,
Maxx
